#+BEGIN_COMMENT
.. title: How much coal does it take to power a light bulb?
.. slug: how-much-coal-to-power-a-light-bulb
.. date: 2022-06-15 17:28:30 UTC-07:00
.. tags: global warming
.. category: Global Warming
.. link: 
.. description: 
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-ba296230-159a-4741-920a-e7289292d292.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
* How many Joules of energy does it take to power a 100 Watt light bulb for one day?

**Given:**

\[
1 Watt = 1 \frac{Joule}{Second}
\]

For a 100 Watt Bulb:

\[
\require{cancel}
(100 \cancel{Watt})\left(1 \frac{\frac{Joule}{Second}}{\cancel{Watt}}\right) = 100 \frac{Joule}{Second}
\]

For One Minute:

\[
\left(100 \frac{Joule}{\cancel{Second}}\right) \left(60 \frac{\cancel{Second}}{Minute}\right) = 6{,}000 \frac{Joule}{Minute}
\]

For One Hour:

\[
\left(6 \times 10^3 \frac{Joule}{\cancel{Minute}}\right)\left(60 \frac{\cancel{Minute}}{Hour}\right) = 3.6 \times 10^5 \frac{Joule}{Hour}
\]

For One Day:

\[
\left(3.6 \times 10^5 \frac{Joule}{\cancel{Hour}}\right)\left(24 \frac{\cancel{Hour}}{Day}\right) = 8.64 \times 10^6 \frac{Joule}{Day}
\]

* Double-Check The Math
#+begin_src python :results output :exports both
bulb = 100 # Watt (Joule/Second)
per_minute = bulb * 60 # Second/Minute
per_hour = per_minute * 60 # Minute/Hour
per_day = per_hour * 24 # Hour/Day
print(f"A 100 Watt Light bulb uses {per_day:0.2e} Joules per day.")
#+end_src

#+RESULTS:
: A 100 Watt Light bulb uses 8.64e+06 Joules per day.
